## Mission : 1

In [1]:
import pandas as pd
import re
data_files = [
    "Schools/ap_2010.csv",
    "Schools/class_size.csv",
    "Schools/demographics.csv",
    "Schools/graduation.csv",
    "Schools/hs_directory.csv",
    "Schools/sat_results.csv"
]
data = {}
var_names=[]
pattern = r"\w+\/(\w+)"
for d in data_files:
    var_names.append(re.findall(pattern,d))
for c in range(0,6,1):
    data[var_names[c][0]]=pd.read_csv(data_files[c])
    
print(data)

{'ap_2010':         DBN                                         SchoolName  \
0    01M448                       UNIVERSITY NEIGHBORHOOD H.S.
1    01M450                             EAST SIDE COMMUNITY HS
2    01M515                                LOWER EASTSIDE PREP
3    01M539                     NEW EXPLORATIONS SCI,TECH,MATH
4    02M296              High School of Hospitality Management
..      ...                                                ...
253  31R605                         STATEN ISLAND TECHNICAL HS
254  32K545                      EBC-HS FOR PUB SERVICE (BUSH)
255  32K552                          Academy of Urban Planning
256  32K554               All City Leadership Secondary School
257  32K556  Bushwick Leaders High School for Academic Exce...

     AP Test Takers   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               39.0               49.0                                  10.0
1               19.0               21.0                                   NaN
2               24.0               26.0                                  24.0
3              255.0              377.0                                 191.0
4                NaN                NaN                                   NaN
..               ...                ...                                   ...
253            528.0              905.0                                 809.0
254             47.0               64.0                                  13.0
255             76.0              100.0                                  10.0
256              7.0                8.0                                   NaN
257             34.0               35.0                                  18.0

[258 rows x 5 columns], 'class_size':        CSD BOROUGH SCHOOL CODE                     SCHOOL NAME GRADE   \
0        1       M        M015       P.S. 015 Roberto Clemente     0K
1        1       M        M015       P.S. 015 Roberto Clemente     0K
2        1       M        M015       P.S. 015 Roberto Clemente     01
3        1       M        M015       P.S. 015 Roberto Clemente     01
4        1       M        M015       P.S. 015 Roberto Clemente     02
...    ...     ...         ...                             ...    ...
27606   32       K        K564  Bushwick Community High School  09-12
27607   32       K        K564  Bushwick Community High School  09-12
27608   32       K        K564  Bushwick Community High School  09-12
27609   32       K        K564  Bushwick Community High School  09-12
27610   32       K        K564  Bushwick Community High School    NaN

      PROGRAM TYPE CORE SUBJECT (MS CORE and 9-12 ONLY)  \
0           GEN ED                                    -
1              CTT                                    -
2           GEN ED                                    -
3              CTT                                    -
4           GEN ED                                    -
...            ...                                  ...
27606       GEN ED                       SOCIAL STUDIES
27607       GEN ED                       SOCIAL STUDIES
27608       GEN ED                       SOCIAL STUDIES
27609          CTT                                 MATH
27610          NaN                                  NaN

      CORE COURSE (MS CORE and 9-12 ONLY) SERVICE CATEGORY(K-9* ONLY)  \
0                                       -                           -
1                                       -                           -
2                                       -                           -
3                                       -                           -
4                                       -                           -
...                                   ...                         ...
27606             US History & Government                           -
27607                           Economics                           -
27608         Participation in Government                           -
27609                  Integrated Algebra                           -
27610                                 NaN                         NaN

       NUMBER OF STUDENTS / SEATS FILLED  NUMBER OF SECTIONS  \
0                                   19.0                 1.0
1                                   21.0                 1.0
2                                   17.0                 1.0
3                                   17.0                 1.0
4                                   15.0                 1.0
...                                  ...                 ...
27606                              256.0                10.0
27607                               65.0                 2.0
27608                               53.0                 2.0
27609                               50.0                 2.0
27610                                NaN                 NaN

       AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  SIZE OF LARGEST CLASS  \
0                    19.0                    19.0                   19.0
1                    21.0                    21.0                   21.0
2                    17.0                    17.0                   17.0
3                    17.0                    17.0                   17.0
4                    15.0                    15.0                   15.0
...                   ...                     ...                    ...
27606                25.6                    15.0                   35.0
27607                32.5                    32.0                   33.0
27608                26.5                    25.0                   28.0
27609                25.0                    25.0                   25.0
27610                 NaN                     NaN                    NaN

      DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO
0             ATS                             NaN
1             ATS                             NaN
2             ATS                             NaN
3             ATS                             NaN
4             ATS                             NaN
...           ...                             ...
27606       STARS                             NaN
27607       STARS                             NaN
27608       STARS                             NaN
27609       STARS                             NaN
27610         NaN                            17.1

[27611 rows x 16 columns], 'demographics':           DBN                                              Name  schoolyear  \
0      01M015                         P.S. 015 ROBERTO CLEMENTE    20052006
1      01M015                         P.S. 015 ROBERTO CLEMENTE    20062007
2      01M015                         P.S. 015 ROBERTO CLEMENTE    20072008
3      01M015                         P.S. 015 ROBERTO CLEMENTE    20082009
4      01M015                         P.S. 015 ROBERTO CLEMENTE    20092010
...       ...                                               ...         ...
10070  32K564                    BUSHWICK COMMUNITY HIGH SCHOOL    20072008
10071  32K564                    BUSHWICK COMMUNITY HIGH SCHOOL    20082009
10072  32K564                    BUSHWICK COMMUNITY HIGH SCHOOL    20092010
10073  32K564                    BUSHWICK COMMUNITY HIGH SCHOOL    20102011
10074  32K564  BUSHWICK COMMUNITY HIGH SCHOOL                      20112012

      fl_percent  frl_percent  total_enrollment  prek     k grade1 grade2  \
0           89.4          NaN               281    15    36     40     33
1           89.4          NaN               243    15    29     39     38
2           89.4          NaN               261    18    43     39     36
3           89.4          NaN               252    17    37     44     32
4                        96.5               208    16    40     28     32
...          ...          ...               ...   ...   ...    ...    ...
10070       85.6          NaN               355   NaN   NaN    NaN    NaN
10071       65.2          NaN               383   NaN   NaN    NaN    NaN
10072                    89.2               395   NaN   NaN    NaN    NaN
10073                    88.2               420   NaN   NaN    NaN    NaN
10074        NaN         81.8               382

       ... black_num black_per hispanic_num hispanic_per white_num white_per  \
0      ...        74      26.3          189         67.3         5       1.8
1      ...        68      28.0          153         63.0         4       1.6
2      ...        77      29.5          157         60.2         7       2.7
3      ...        75      29.8          149         59.1         7       2.8
4      ...        67      32.2          118         56.7         6       2.9
...    ...       ...       ...          ...          ...       ...       ...
10070  ...       151      42.5          198         55.8         5       1.4
10071  ...       132      34.5          245         64.0         2       0.5
10072  ...       146      37.0          242         61.3         3       0.8
10073  ...       166      39.5          242         57.6         8       1.9
10074  ...       137      35.9          235         61.5         7       1.8

      male_num male_per female_num female_per
0        158.0     56.2      123.0       43.8
1        140.0     57.6      103.0       42.4
2        143.0     54.8      118.0       45.2
3        149.0     59.1      103.0       40.9
4        124.0     59.6       84.0       40.4
...        ...      ...        ...        ...
10070    181.0     51.0      174.0       49.0
10071    206.0     53.8      177.0       46.2
10072    199.0     50.4      196.0       49.6
10073    209.0     49.8      211.0       50.2
10074    169.0     44.2      213.0       55.8

[10075 rows x 38 columns], 'graduation':         Demographic     DBN                            School Name    Cohort  \
0      Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2003
1      Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2004
2      Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2005
3      Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2006
4      Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL  2006 Aug
...             ...     ...                                    ...       ...
25091          Male  32K564         BUSHWICK COMMUNITY HIGH SCHOOL      2003
25092          Male  32K564         BUSHWICK COMMUNITY HIGH SCHOOL      2004
25093          Male  32K564         BUSHWICK COMMUNITY HIGH SCHOOL      2005
25094          Male  32K564         BUSHWICK COMMUNITY HIGH SCHOOL      2006
25095          Male  32K564         BUSHWICK COMMUNITY HIGH SCHOOL  2006 Aug

       Total Cohort Total Grads - n  Total Grads - % of cohort  \
0                 5               s                        NaN
1                55              37                       67.3
2                64              43                       67.2
3                78              43                       55.1
4                78              44                       56.4
...             ...             ...                        ...
25091            65               1                        1.5
25092            64               2                        3.1
25093            79               3                        3.8
25094            57               4                        7.0
25095            57               4                        7.0

      Total Regents - n  Total Regents - % of cohort  \
0                     s                          NaN
1                    17                         30.9
2                    27                         42.2
3                    36                         46.2
4                    37                         47.4
...                 ...                          ...
25091                 0                          0.0
25092                 0                          0.0
25093                 1                          1.3
25094                 2                          3.5
25095                 2                          3.5

       Total Regents - % of grads  ... Regents w/o Advanced - n  \
0                             NaN  ...                        s
1                            45.9  ...                       17
2                            62.8  ...                       27
3                            83.7  ...                       36
4                            84.1  ...                       37
...                           ...  ...                      ...
25091                         0.0  ...                        0
25092                         0.0  ...                        0
25093                        33.3  ...                        1
25094                        50.0  ...                        2
25095                        50.0  ...                        2

       Regents w/o Advanced - % of cohort  Regents w/o Advanced - % of grads  \
0                                     NaN                                NaN
1                                    30.9                               45.9
2                                    42.2                               62.8
3                                    46.2                               83.7
4                                    47.4                               84.1
...                                   ...                                ...
25091                                 0.0                                0.0
25092                                 0.0                                0.0
25093                                 1.3                               33.3
25094                                 3.5                               50.0
25095                                 3.5                               50.0

      Local - n  Local - % of cohort  Local - % of grads Still Enrolled - n  \
0             s                  NaN                 NaN                  s
1            20                 36.4                54.1                 15
2            16                 25.0                37.2                  9
3             7                  9.0                16.3                 16
4             7                  9.0                15.9                 15
...         ...                  ...                 ...                ...
25091         1                  1.5               100.0               44.0
25092         2                  3.1               100.0               38.0
25093         2                  2.5                66.7               46.0
25094         2                  3.5                50.0               34.0
25095         2                  3.5                50.0               34.0

       Still Enrolled - % of cohort  Dropped Out - n Dropped Out - % of cohort
0                               NaN                s                       NaN
1                              27.3                3                       5.5
2                              14.1                9                      14.1
3                              20.5               11                      14.1
4                              19.2               11                      14.1
...                             ...              ...                       ...
25091                          67.7             20.0                      30.8
25092                          59.4             22.0                      34.4
25093                          58.2             28.0                      35.4
25094                          59.6             17.0                      29.8
25095                          59.6             17.0                      29.8

[25096 rows x 23 columns], 'hs_directory':         dbn                                        school_name    borough  \
0    27Q260          Frederick Douglass Academy VI High School     Queens
1    21K559        Life Academy High School for Film and Music   Brooklyn
2    16K393     Frederick Douglass Academy IV Secondary School   Brooklyn
3    08X305                               Pablo Neruda Academy      Bronx
4    03M485  Fiorello H. LaGuardia High School of Music & A...  Manhattan
..      ...                                                ...        ...
430  02M300  Urban Assembly School of Design and Constructi...  Manhattan
431  09X412                      Bronx High School of Business      Bronx
432  32K549                 Bushwick School for Social Justice   Brooklyn
433  02M407              Institute for Collaborative Education  Manhattan
434  21K344      Rachel Carson High School for Coastal Studies   Brooklyn

    building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0            Q465  718-471-2154  718-471-2890             9.0              12
1            K400  718-333-7750  718-333-7775             9.0              12
2            K026  718-574-2820  718-574-2821             9.0              12
3            X450  718-824-1682  718-824-1663             9.0              12
4            M485  212-496-0700  212-724-5748             9.0              12
..            ...           ...           ...             ...             ...
430          M535  212-586-0981  212-586-1731             9.0              12
431          X410  718-410-4060  718-992-5760             9.0              12
432          K480  718-381-7100  718-418-0192             9.0              12
433          M475  212-475-7972  212-475-0459             6.0              12
434          K303  718-265-0329  718-372-2514             9.0              12

     expgrade_span_min  expgrade_span_max  ... priority08 priority09  \
0                  NaN                NaN  ...        NaN        NaN
1                  NaN                NaN  ...        NaN        NaN
2                  NaN                NaN  ...        NaN        NaN
3                  NaN                NaN  ...        NaN        NaN
4                  NaN                NaN  ...        NaN        NaN
..                 ...                ...  ...        ...        ...
430                NaN                NaN  ...        NaN        NaN
431                NaN                NaN  ...        NaN        NaN
432                NaN                NaN  ...        NaN        NaN
433                NaN                NaN  ...        NaN        NaN
434                NaN                NaN  ...        NaN        NaN

    priority10                                         Location 1  \
0          NaN  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...
1          NaN  2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...
2          NaN  1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...
3          NaN  1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...
4          NaN  100 Amsterdam Avenue\nNew York, NY 10023\n(40....
..         ...                                                ...
430        NaN  525 West 50Th Street\nNew York, NY 10019\n(40....
431        NaN  240 East 172 Street\nBronx, NY 10457\n(40.8403...
432        NaN  400 Irving Avenue\nBrooklyn, NY 11237\n(40.696...
433        NaN  345 East 15Th Street\nNew York, NY 10003\n(40....
434        NaN  521 West Avenue\nBrooklyn, NY 11224\n(40.58211...

    Community Board  Council District Census Tract        BIN           BBL  \
0              14.0              31.0     100802.0  4300730.0  4.157360e+09
1              13.0              47.0        306.0  3186454.0  3.068830e+09
2               3.0              36.0        291.0  3393805.0  3.016160e+09
3               9.0              18.0         16.0  2022205.0  2.036040e+09
4               7.0               6.0        151.0  1030341.0  1.011560e+09
..              ...               ...          ...        ...           ...
430             4.0               3.0        135.0  1083802.0  1.010790e+09
431             4.0              16.0        225.0  2007806.0  2.028170e+09
432             4.0              37.0        435.0  3076908.0  3.033650e+09
433             6.0               2.0         48.0  1020419.0  1.009220e+09
434            13.0              47.0        354.0  3196292.0  3.072500e+09


## Exploring sat_results

In [2]:
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

## Exploring Each Dataset

In [3]:
for key in data:
    print(key,":\n",data[key].head())

ap_2010 :
       DBN                             SchoolName  AP Test Takers   \
0  01M448           UNIVERSITY NEIGHBORHOOD H.S.             39.0
1  01M450                 EAST SIDE COMMUNITY HS             19.0
2  01M515                    LOWER EASTSIDE PREP             24.0
3  01M539         NEW EXPLORATIONS SCI,TECH,MATH            255.0
4  02M296  High School of Hospitality Management              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               49.0                                  10.0
1               21.0                                   NaN
2               26.0                                  24.0
3              377.0                                 191.0
4                NaN                                   NaN
class_size :
    CSD BOROUGH SCHOOL CODE                SCHOOL NAME GRADE  PROGRAM TYPE  \
0    1       M        M015  P.S. 015 Roberto Clemente     0K       GEN ED
1    1       M        M015  P.S. 015 Roberto Clemente     0K          CTT
2    1       M        M015  P.S. 015 Roberto Clemente     01       GEN ED
3    1       M        M015  P.S. 015 Roberto Clemente     01          CTT
4    1       M        M015  P.S. 015 Roberto Clemente     02       GEN ED

  CORE SUBJECT (MS CORE and 9-12 ONLY) CORE COURSE (MS CORE and 9-12 ONLY)  \
0                                    -                                   -
1                                    -                                   -
2                                    -                                   -
3                                    -                                   -
4                                    -                                   -

  SERVICE CATEGORY(K-9* ONLY)  NUMBER OF STUDENTS / SEATS FILLED  \
0                           -                               19.0
1                           -                               21.0
2                           -                               17.0
3                           -                               17.0
4                           -                               15.0

   NUMBER OF SECTIONS  AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  \
0                 1.0                19.0                    19.0
1                 1.0                21.0                    21.0
2                 1.0                17.0                    17.0
3                 1.0                17.0                    17.0
4                 1.0                15.0                    15.0

   SIZE OF LARGEST CLASS DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO
0                   19.0         ATS                             NaN
1                   21.0         ATS                             NaN
2                   17.0         ATS                             NaN
3                   17.0         ATS                             NaN
4                   15.0         ATS                             NaN
demographics :
       DBN                       Name  schoolyear fl_percent  frl_percent  \
0  01M015  P.S. 015 ROBERTO CLEMENTE    20052006       89.4          NaN
1  01M015  P.S. 015 ROBERTO CLEMENTE    20062007       89.4          NaN
2  01M015  P.S. 015 ROBERTO CLEMENTE    20072008       89.4          NaN
3  01M015  P.S. 015 ROBERTO CLEMENTE    20082009       89.4          NaN
4  01M015  P.S. 015 ROBERTO CLEMENTE    20092010                    96.5

   total_enrollment prek   k grade1 grade2  ... black_num black_per  \
0               281   15  36     40     33  ...        74      26.3
1               243   15  29     39     38  ...        68      28.0
2               261   18  43     39     36  ...        77      29.5
3               252   17  37     44     32  ...        75      29.8
4               208   16  40     28     32  ...        67      32.2

  hispanic_num hispanic_per white_num white_per male_num male_per female_num  \
0          189         67.3         5       1.8    158.0     56.2      123.0
1          153         63.0         4       1.6    140.0     57.6      103.0
2          157         60.2         7       2.7    143.0     54.8      118.0
3          149         59.1         7       2.8    149.0     59.1      103.0
4          118         56.7         6       2.9    124.0     59.6       84.0

  female_per
0       43.8
1       42.4
2       45.2
3       40.9
4       40.4

[5 rows x 38 columns]
graduation :
     Demographic     DBN                            School Name    Cohort  \
0  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2003
1  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2004
2  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2005
3  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2006
4  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL  2006 Aug

   Total Cohort Total Grads - n  Total Grads - % of cohort Total Regents - n  \
0             5               s                        NaN                 s
1            55              37                       67.3                17
2            64              43                       67.2                27
3            78              43                       55.1                36
4            78              44                       56.4                37

   Total Regents - % of cohort  Total Regents - % of grads  ...  \
0                          NaN                         NaN  ...
1                         30.9                        45.9  ...
2                         42.2                        62.8  ...
3                         46.2                        83.7  ...
4                         47.4                        84.1  ...

  Regents w/o Advanced - n  Regents w/o Advanced - % of cohort  \
0                        s                                 NaN
1                       17                                30.9
2                       27                                42.2
3                       36                                46.2
4                       37                                47.4

   Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
0                                NaN         s                  NaN
1                               45.9        20                 36.4
2                               62.8        16                 25.0
3                               83.7         7                  9.0
4                               84.1         7                  9.0

   Local - % of grads Still Enrolled - n  Still Enrolled - % of cohort  \
0                 NaN                  s                           NaN
1                54.1                 15                          27.3
2                37.2                  9                          14.1
3                16.3                 16                          20.5
4                15.9                 15                          19.2

   Dropped Out - n Dropped Out - % of cohort
0                s                       NaN
1                3                       5.5
2                9                      14.1
3               11                      14.1
4               11                      14.1

[5 rows x 23 columns]
hs_directory :
       dbn                                        school_name    borough  \
0  27Q260          Frederick Douglass Academy VI High School     Queens
1  21K559        Life Academy High School for Film and Music   Brooklyn
2  16K393     Frederick Douglass Academy IV Secondary School   Brooklyn
3  08X305                               Pablo Neruda Academy      Bronx
4  03M485  Fiorello H. LaGuardia High School of Music & A...  Manhattan

  building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0          Q465  718-471-2154  718-471-2890             9.0              12
1          K400  718-333-7750  718-333-7775             9.0              12
2          K026  718-574-2820  718-574-2821             9.0              12
3          X450  718-824-1682  718-824-1663             9.0              12
4          M485  212-496-0700  212-724-5748             9.0              12

   expgrade_span_min  expgrade_span_max  ... priority08 priority09 priority10  \
0                NaN                NaN  ...        NaN        NaN        NaN
1                NaN                NaN  ...        NaN        NaN        NaN
2                NaN                NaN  ...        NaN        NaN        NaN
3                NaN                NaN  ...        NaN        NaN        NaN
4                NaN                NaN  ...        NaN        NaN        NaN

                                          Location 1 Community Board  \
0  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...            14.0
1  2630 Benson Avenue\nBrooklyn, NY 11214\n(40.59...            13.0
2  1014 Lafayette Avenue\nBrooklyn, NY 11221\n(40...             3.0
3  1980 Lafayette Avenue\nBronx, NY 10473\n(40.82...             9.0
4  100 Amsterdam Avenue\nNew York, NY 10023\n(40....             7.0

   Council District Census Tract        BIN           BBL  \
0              31.0     100802.0  4300730.0  4.157360e+09
1              47.0        306.0  3186454.0  3.068830e+09
2              36.0        291.0  3393805.0  3.016160e+09
3              18.0         16.0  2022205.0  2.036040e+09
4               6.0        151.0  1030341.0  1.011560e+09

                                                 NTA
0  Far Rockaway-Bayswater                        ...
1  Gravesend                                     ...
2  Stuyvesant Heights                            ...
3  Soundview-Castle Hill-Clason Point-Harding Par...
4  Lincoln Square                                ...

[5 rows x 64 columns]
sat_results :
       DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score
0                    363
1                    366
2                    370
3                    359
4                    384

In [4]:
all_survey = pd.read_csv("Schools/survey_all.txt", delimiter = "\t",encoding = "windows-1252")
d75_survey = pd.read_csv("Schools/d75_survey.txt", delimiter = "\t",encoding = "windows-1252")
survey = pd.concat([all_survey,d75_survey],axis=0,sort=True)
survey.head()

,N_p,N_s,N_t,aca_p_11,aca_s_11,aca_t_11,aca_tot_11,bn,com_p_11,com_s_11,...,t_q8c_1,t_q8c_2,t_q8c_3,t_q8c_4,t_q9,t_q9_1,t_q9_2,t_q9_3,t_q9_4,t_q9_5
0,90.0,NaN,22.0,7.8,NaN,7.9,7.9,M015,7.6,NaN,...,29.0,67.0,5.0,0.0,NaN,5.0,14.0,52.0,24.0,5.0
1,161.0,NaN,34.0,7.8,NaN,9.1,8.4,M019,7.6,NaN,...,74.0,21.0,6.0,0.0,NaN,3.0,6.0,3.0,78.0,9.0
2,367.0,NaN,42.0,8.6,NaN,7.5,8.0,M020,8.3,NaN,...,33.0,35.0,20.0,13.0,NaN,3.0,5.0,16.0,70.0,5.0
3,151.0,145.0,29.0,8.5,7.4,7.8,7.9,M034,8.2,5.9,...,21.0,45.0,28.0,7.0,NaN,0.0,18.0,32.0,39.0,11.0
4,90.0,NaN,23.0,7.9,NaN,8.1,8.0,M063,7.9,NaN,...,59.0,36.0,5.0,0.0,NaN,10.0,5.0,10.0,60.0,15.0

In [5]:
survey["DBN"] = survey["dbn"]
survey = survey.loc[:,["DBN", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"]]
data["survey"] = survey
survey.shape

(1702, 23)

In [6]:
data["hs_directory"]["DBN"] = data["hs_directory"]["dbn"]
def padded(n):
    n = str(n)
    if len(n) > 1:
        return n
    else:
        return "0"+n
data['class_size']["padded_csd"] = data["class_size"]["CSD"].apply(padded)
data["class_size"]["DBN"] = data['class_size']["padded_csd"] + data['class_size']["SCHOOL CODE"]
data["class_size"]["DBN"].head()

0    01M015
1    01M015
2    01M015
3    01M015
4    01M015
Name: DBN, dtype: object

In [7]:

data["sat_results"]["SAT Math Avg. Score"] = pd.to_numeric(data["sat_results"]["SAT Math Avg. Score"], errors = "coerce")
data["sat_results"]["SAT Critical Reading Avg. Score"] = pd.to_numeric(data["sat_results"]["SAT Critical Reading Avg. Score"], errors = "coerce")
data["sat_results"]["SAT Writing Avg. Score"] = pd.to_numeric(data["sat_results"]["SAT Writing Avg. Score"], errors = "coerce")
data["sat_results"]["sat_score"] = data["sat_results"]["SAT Math Avg. Score"] + data["sat_results"]["SAT Critical Reading Avg. Score"] + data["sat_results"]["SAT Writing Avg. Score"]

data["sat_results"]["sat_score"].head()

0    1122.0
1    1172.0
2    1149.0
3    1174.0
4    1207.0
Name: sat_score, dtype: float64

In [8]:
def extraction(string):
    coordinates = re.findall("\(.+\)" , string)
    coordinates = coordinates[0].split(",")[0].replace("(","")
    return coordinates
    
data["hs_directory"]["lat"] = data["hs_directory"]["Location 1"].apply(extraction)
data["hs_directory"]["lat"].head()

0    40.601989336
1    40.593593811
2    40.692133704
3    40.822303765
4    40.773670507
Name: lat, dtype: object

In [9]:
def extraction(string):
    coordinates = re.findall("\(.+\)" , string)
    coordinates = coordinates[0].split(",")[1].replace(")","")
    return coordinates
    
data["hs_directory"]["lon"] = data["hs_directory"]["Location 1"].apply(extraction)
data["hs_directory"]["lon"] = pd.to_numeric(data["hs_directory"]["lon"],errors = "coerce")
data["hs_directory"]["lat"] = pd.to_numeric(data["hs_directory"]["lat"],errors = "coerce")

## Mission : 2

In [10]:
class_size = data["class_size"]
class_size = class_size[class_size["GRADE "] == "09-12"]
class_size = class_size[class_size["PROGRAM TYPE"] == "GEN ED"]
class_size.head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
225,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292
226,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 10,-,79.0,3.0,26.3,24.0,31.0,STARS,NaN,01,01M292
227,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 11,-,38.0,2.0,19.0,16.0,22.0,STARS,NaN,01,01M292
228,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 12,-,69.0,3.0,23.0,13.0,30.0,STARS,NaN,01,01M292
229,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,MATH,Integrated Algebra,-,53.0,3.0,17.7,16.0,21.0,STARS,NaN,01,01M292

In [11]:
# handling duplicates
import numpy
class_size = class_size.groupby("DBN").agg(numpy.mean)
class_size.reset_index(inplace=True)
data["class_size"]=class_size
data["class_size"].head()

,DBN,CSD,NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,SCHOOLWIDE PUPIL-TEACHER RATIO
0,01M292,1,88.0000,4.000000,22.564286,18.50,26.571429,NaN
1,01M332,1,46.0000,2.000000,22.000000,21.00,23.500000,NaN
2,01M378,1,33.0000,1.000000,33.000000,33.00,33.000000,NaN
3,01M448,1,105.6875,4.750000,22.231250,18.25,27.062500,NaN
4,01M450,1,57.6000,2.733333,21.200000,19.40,22.866667,NaN

In [12]:
data["demographics"] = data["demographics"][data["demographics"]["schoolyear"] == 20112012]
data["demographics"].head()

,DBN,Name,schoolyear,fl_percent,frl_percent,total_enrollment,prek,k,grade1,grade2,...,black_num,black_per,hispanic_num,hispanic_per,white_num,white_per,male_num,male_per,female_num,female_per
6,01M015,P.S. 015 ROBERTO CLEMENTE,20112012,NaN,89.4,189,13,31,35,28,...,63,33.3,109,57.7,4,2.1,97.0,51.3,92.0,48.7
13,01M019,P.S. 019 ASHER LEVY,20112012,NaN,61.5,328,32,46,52,54,...,81,24.7,158,48.2,28,8.5,147.0,44.8,181.0,55.2
20,01M020,PS 020 ANNA SILVER,20112012,NaN,92.5,626,52,102,121,87,...,55,8.8,357,57.0,16,2.6,330.0,52.7,296.0,47.3
27,01M034,PS 034 FRANKLIN D ROOSEVELT,20112012,NaN,99.7,401,14,34,38,36,...,90,22.4,275,68.6,8,2.0,204.0,50.9,197.0,49.1
35,01M063,PS 063 WILLIAM MCKINLEY,20112012,NaN,78.9,176,18,20,30,21,...,41,23.3,110,62.5,15,8.5,97.0,55.1,79.0,44.9

In [13]:
data["graduation"] = data["graduation"][data["graduation"]["Cohort"] == "2006"]
data["graduation"] = data["graduation"][data["graduation"]["Demographic"] == "Total Cohort"]
data["graduation"].head()

,Demographic,DBN,School Name,Cohort,Total Cohort,Total Grads - n,Total Grads - % of cohort,Total Regents - n,Total Regents - % of cohort,Total Regents - % of grads,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
3,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2006,78,43,55.1,36,46.2,83.7,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
10,Total Cohort,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,2006,124,53,42.7,42,33.9,79.2,...,34,27.4,64.2,11,8.9,20.8,46,37.1,20,16.1
17,Total Cohort,01M450,EAST SIDE COMMUNITY SCHOOL,2006,90,70,77.8,67,74.4,95.7,...,67,74.4,95.7,3,3.3,4.3,15,16.7,5,5.6
24,Total Cohort,01M509,MARTA VALLE HIGH SCHOOL,2006,84,47,56.0,40,47.6,85.1,...,23,27.4,48.9,7,8.3,14.9,25,29.8,5,6.0
31,Total Cohort,01M515,LOWER EAST SIDE PREPARATORY HIGH SCHO,2006,193,105,54.4,91,47.2,86.7,...,22,11.4,21.0,14,7.3,13.3,53,27.5,35,18.1

In [14]:
cols = ['AP Test Takers ', 'Total Exams Taken', 'Number of Exams with scores 3 4 or 5']
for c in cols:
    data["ap_2010"][c] = pd.to_numeric(data["ap_2010"][c],errors = "coerce")
data["ap_2010"][cols].dtypes

AP Test Takers                          float64
Total Exams Taken                       float64
Number of Exams with scores 3 4 or 5    float64
dtype: object

In [15]:
combined = data["sat_results"]
combined = combined.merge(data["ap_2010"], on = "DBN",how="left")
combined = combined.merge(data["graduation"], on = "DBN",how="left")
combined.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,NaN,NaN,NaN,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.0,49.0,...,34,27.4,64.2,11,8.9,20.8,46,37.1,20,16.1
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.0,21.0,...,67,74.4,95.7,3,3.3,4.3,15,16.7,5,5.6
3,01M458,FORSYTH SATELLITE ACADEMY,7,414.0,401.0,359.0,1174.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,NaN,NaN,NaN,...,23,27.4,48.9,7,8.3,14.9,25,29.8,5,6.0

In [16]:
combined = combined.merge(data['class_size'],on='DBN',how='inner')
combined = combined.merge(data['demographics'],on='DBN',how='inner')
combined = combined.merge(data['survey'],on='DBN',how='inner')
combined = combined.merge(data['hs_directory'],on='DBN',how='inner')
print(combined.head())
print(combined.shape)

      DBN                                        SCHOOL NAME  \
0  01M292      HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448                UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                         EAST SIDE COMMUNITY SCHOOL
3  01M509                            MARTA VALLE HIGH SCHOOL
4  01M539  NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...

  Num of SAT Test Takers  SAT Critical Reading Avg. Score  \
0                     29                            355.0
1                     91                            383.0
2                     70                            377.0
3                     44                            390.0
4                    159                            522.0

   SAT Math Avg. Score  SAT Writing Avg. Score  sat_score  \
0                404.0                   363.0     1122.0
1                423.0                   366.0     1172.0
2                402.0                   370.0     1149.0
3                433.0                   384.0     1207.0
4                574.0                   525.0     1621.0

                       SchoolName  AP Test Takers   Total Exams Taken  ...  \
0                             NaN              NaN                NaN  ...
1    UNIVERSITY NEIGHBORHOOD H.S.             39.0               49.0  ...
2          EAST SIDE COMMUNITY HS             19.0               21.0  ...
3                             NaN              NaN                NaN  ...
4  NEW EXPLORATIONS SCI,TECH,MATH            255.0              377.0  ...

   priority10                                         Location 1  \
0         NaN  220 Henry Street\nNew York, NY 10002\n(40.7137...
1         NaN  200 Monroe Street\nNew York, NY 10002\n(40.712...
2         NaN  420 East 12 Street\nNew York, NY 10009\n(40.72...
3         NaN  145 Stanton Street\nNew York, NY 10002\n(40.72...
4         NaN  111 Columbia Street\nNew York, NY 10002\n(40.7...

  Community Board Council District  Census Tract        BIN           BBL  \
0             3.0              1.0         201.0  1003223.0  1.002690e+09
1             3.0              1.0         202.0  1003214.0  1.002590e+09
2             3.0              2.0          34.0  1005974.0  1.004390e+09
3             3.0              1.0        3001.0  1004323.0  1.003540e+09
4             3.0              2.0        2201.0  1004070.0  1.003350e+09

                                                 NTA        lat        lon
0  Lower East Side                               ...  40.713764 -73.985260
1  Lower East Side                               ...  40.712332 -73.984797
2  East Village                                  ...  40.729783 -73.983041
3  Chinatown                                     ...  40.720569 -73.985673
4  Lower East Side                               ...  40.718725 -73.979426

[5 rows x 165 columns]
(363, 165)

In [17]:
# handling missing values
mean = combined.mean()
combined = combined.fillna(mean)
combined = combined.fillna(0)
combined.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,priority10,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,lat,lon
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,0,129.028846,197.038462,...,0,"220 Henry Street\nNew York, NY 10002\n(40.7137...",3.0,1.0,201.0,1003223.0,1.002690e+09,Lower East Side ...,40.713764,-73.985260
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.000000,49.000000,...,0,"200 Monroe Street\nNew York, NY 10002\n(40.712...",3.0,1.0,202.0,1003214.0,1.002590e+09,Lower East Side ...,40.712332,-73.984797
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.000000,21.000000,...,0,"420 East 12 Street\nNew York, NY 10009\n(40.72...",3.0,2.0,34.0,1005974.0,1.004390e+09,East Village ...,40.729783,-73.983041
3,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,0,129.028846,197.038462,...,0,"145 Stanton Street\nNew York, NY 10002\n(40.72...",3.0,1.0,3001.0,1004323.0,1.003540e+09,Chinatown ...,40.720569,-73.985673
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522.0,574.0,525.0,1621.0,"NEW EXPLORATIONS SCI,TECH,MATH",255.000000,377.000000,...,0,"111 Columbia Street\nNew York, NY 10002\n(40.7...",3.0,2.0,2201.0,1004070.0,1.003350e+09,Lower East Side ...,40.718725,-73.979426

In [18]:
def ret_dbn(dbn):
    return dbn[0:2]

combined["school_dist"] = combined["DBN"].apply(ret_dbn)
combined.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score,SchoolName,AP Test Takers,Total Exams Taken,...,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,lat,lon,school_dist
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0,0,129.028846,197.038462,...,"220 Henry Street\nNew York, NY 10002\n(40.7137...",3.0,1.0,201.0,1003223.0,1.002690e+09,Lower East Side ...,40.713764,-73.985260,01
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0,UNIVERSITY NEIGHBORHOOD H.S.,39.000000,49.000000,...,"200 Monroe Street\nNew York, NY 10002\n(40.712...",3.0,1.0,202.0,1003214.0,1.002590e+09,Lower East Side ...,40.712332,-73.984797,01
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0,EAST SIDE COMMUNITY HS,19.000000,21.000000,...,"420 East 12 Street\nNew York, NY 10009\n(40.72...",3.0,2.0,34.0,1005974.0,1.004390e+09,East Village ...,40.729783,-73.983041,01
3,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0,0,129.028846,197.038462,...,"145 Stanton Street\nNew York, NY 10002\n(40.72...",3.0,1.0,3001.0,1004323.0,1.003540e+09,Chinatown ...,40.720569,-73.985673,01
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522.0,574.0,525.0,1621.0,"NEW EXPLORATIONS SCI,TECH,MATH",255.000000,377.000000,...,"111 Columbia Street\nNew York, NY 10002\n(40.7...",3.0,2.0,2201.0,1004070.0,1.003350e+09,Lower East Side ...,40.718725,-73.979426,01